tickets/app/controllers/players_controller.rb

INSERT INTO "players" ("name", "favorate", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "caojingming"], ["favorate", "sing\r\nswimming"], ["created_at", "2016-08-16 11:42:40.659409"], ["updated_at", "2016-08-16 11:42:40.659409"]]
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save