tickets/app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "seat_id", "address", "price_paid", "email_address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "phone" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["phone", "22238859"], ["updated_at", "2016-08-14 13:44:10.096570"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)